In [38]:
#import libraries

import mysql.connector
from mysql.connector import Error

In [8]:
import pandas as pd

In [10]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
        	host = host_name,
        	user = user_name,
        	password = user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

#Put our MySQL terminal password
pw = "irtiqa123"

#database name
db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [14]:
#create mysql_python

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Database created successfully

In [16]:
#connect to database

def create_db_conn(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password,
        database =  db_name)
        print("MySQL database connection successfull")
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [17]:
#Execute sql queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successfully executed")
    except Error as err:
        print(f"Error: '{err}'")

In [18]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""

#connect to the database
connection = create_db_conn("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successfull
Query was successfully executed

In [22]:
#Insert data

data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-02-02', 2, 800, '123456789'),
(102, 'Nancy', 'Books', '2019-03-21', 3, 700, '1256767789'),
(103, 'Joe', 'Pendrives', '2020-04-12', 10, 600, '12000789'),
(104, 'Danny', 'T-shirts', '2011-06-14', 12, 500, '123458979'),
(105, 'Maria', 'TV', '2021-07-02', 5, 400, '123400089')
"""

connection = create_db_conn("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL database connection successfull
Query was successfully executed

In [23]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [24]:
#Using the SELECT statement
q1 = """
select * from orders
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 2, 2), 2, 800.0, '123456789')
(102, 'Nancy', 'Books', datetime.date(2019, 3, 21), 3, 700.0, '1256767789')
(103, 'Joe', 'Pendrives', datetime.date(2020, 4, 12), 10, 600.0, '12000789')
(104, 'Danny', 'T-shirts', datetime.date(2011, 6, 14), 12, 500.0, '123458979')
(105, 'Maria', 'TV', datetime.date(2021, 7, 2), 5, 400.0, '123400089')

In [25]:
#Using the SELECT statement
q2 = """
select customer_name, phone_number from orders
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successfull
('Steve', '123456789')
('Nancy', '1256767789')
('Joe', '12000789')
('Danny', '123458979')
('Maria', '123400089')

In [27]:
#Using the inbuilt-function statement
q3 = """
select distinct year(date_ordered) from orders
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successfull
(2018,)
(2019,)
(2020,)
(2011,)
(2021,)

In [28]:
#Using the WHERE CLAUSE
q4 = """
select * from orders
 where date_ordered < '2019-12-31'
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 2, 2), 2, 800.0, '123456789')
(102, 'Nancy', 'Books', datetime.date(2019, 3, 21), 3, 700.0, '1256767789')
(104, 'Danny', 'T-shirts', datetime.date(2011, 6, 14), 12, 500.0, '123458979')

In [30]:
#Using the SELECT statement
q5 = """
select * from orders order by unit_price desc;
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 2, 2), 2, 800.0, '123456789')
(102, 'Nancy', 'Books', datetime.date(2019, 3, 21), 3, 700.0, '1256767789')
(103, 'Joe', 'Pendrives', datetime.date(2020, 4, 12), 10, 600.0, '12000789')
(104, 'Danny', 'T-shirts', datetime.date(2011, 6, 14), 12, 500.0, '123458979')
(105, 'Maria', 'TV', datetime.date(2021, 7, 2), 5, 400.0, '123400089')

In [34]:
#create a dataframe from the given table

from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
colums = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "Phone_number"]
df = pd.DataFrame(from_db, columns= colums)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,Phone_number
0,101,Steve,Laptop,2018-02-02,2,800.0,123456789
1,102,Nancy,Books,2019-03-21,3,700.0,1256767789
2,103,Joe,Pendrives,2020-04-12,10,600.0,12000789
3,104,Danny,T-shirts,2011-06-14,12,500.0,123458979
4,105,Maria,TV,2021-07-02,5,400.0,123400089

In [33]:
#Update command

update = """
update orders set unit_price =  45
where order_id = 103
"""
connection = create_db_conn("localhost", "root", pw, db)
execute_query(connection, update)

MySQL database connection successfull
Query was successfully executed

In [35]:
q6 = """
select * from orders where order_id = 103;
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successfull
(103, 'Joe', 'Pendrives', datetime.date(2020, 4, 12), 10, 45.0, '12000789')

In [36]:
#delete record

delete_order = """
delete from orders
where order_id = 105;
"""
connection = create_db_conn("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySQL database connection successfull
Query was successfully executed

In [37]:
#Using the SELECT statement
q9 = """
select * from orders
"""

connection = create_db_conn("localhost", "root", pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Laptop', datetime.date(2018, 2, 2), 2, 800.0, '123456789')
(102, 'Nancy', 'Books', datetime.date(2019, 3, 21), 3, 700.0, '1256767789')
(103, 'Joe', 'Pendrives', datetime.date(2020, 4, 12), 10, 45.0, '12000789')
(104, 'Danny', 'T-shirts', datetime.date(2011, 6, 14), 12, 500.0, '123458979')